{
  "users": [
    {
      "id": 1,
      "username": "Admin",
      "login": "admin",
      "password": "Admin",
      "isAdmin": true
    },
    {
      "id": 2,
      "username": "Ivan",
      "login": "ivan12345",
      "password": "Ivan12345",
      "isAdmin": false
    },
    {
      "id": 3,
      "username": "Petya",
      "login": "petya12345",
      "password": "Petya12345",
      "isAdmin": false
    },
    {
      "isAdmin": true,
      "username": "Denis",
      "password": "Vildanov",
      "login": "denis",
      "id": 4
    }
  ],
  "gamesList": [
    {
      "id": 1,
      "title": "Fortnite",
      "description": "Симулятор выживания от Epic Games с момента выхода в кратчайшие сроки сумел завоевать сердца миллионов геймеров. Причиной тому стал успешный запуск бесплатного режима «Королевская битва», куда ринулись те, кому жалко денег на PUBG. Впрочем, основной режим Fortnite – тот, где нужно строить укрепления и отбиваться от зомби – тоже пользуется успехом, так что игра останется популярной даже после того, как пройдет мода на «Королевскую битву».",
      "link": "https://www.epicgames.com/fortnite",
      "img": "/img/fortnite.jpg",
      "routingUrl": "fortnite"
    },
    {
      "id": 2,
      "title": "PLAYERUNKNOWN`S BATTLEGROUNDS",
      "description": "PUBG стал одной из самых популярных онлайн игр в мире: более 20 млн проданных копий в Раннем доступе, запуск на Xbox One и PS4, онлайн, который превышает количество одновременных пользователей во всех остальных вместе взятых играх Steam. Чрезвычайно удачную концепцию Battle Royale не омрачают даже технические проблемы игры и обилие читеров. Неизвестно, как долго будет длиться триумф Playerunknown`s Battlegrounds, но именно сейчас этот проект заслуженно находится на вершине топа самых обсуждаемых, играемых и, соответственно, самых популярных игр.",
      "link": "https://www.pubg.com/ru/",
      "img": "/img/pubg.jpg",
      "routingUrl": "playerunknownsbattlegrounds"
    },
    {
      "id": 3,
      "title": "LEAGUE OF LEGENDS",
      "description": "Детище Riot Games менее популярно у нас, чем DotA 2, но за рубежом ситуация обратная – там LoL завоевала огромную аудиторию. Множество персонажей, увлекательный геймплей, регулярные обновления, масштабные киберспортивные чемпионаты – вот составляющие успеха игры.",
      "link": "https://ru.leagueoflegends.com/ru/",
      "img": "/img/lol.jpeg",
      "routingUrl": "leagueoflegends"
    },
    {
      "id": 4,
      "title": "DOTA 2",
      "description": "MOBA, которая является единственной игрой в библиотеке у многих пользователей Steam – зачем устанавливать что-то еще, если в DotA 2 можно провести десятки тысяч часов? Эту игру часто ругают за токсичное комьюнити, особенно в ру-сегменте, но не все так печально – найти адекватных игроков здесь проще простого.",
      "link": "https://store.steampowered.com/app/570/Dota_2/",
      "img": "/img/dota.jpg",
      "routingUrl": "dota2"
    },
    {
      "id": 5,
      "title": "WORLD OF WARCRAFT",
      "description": "Разбудите посреди ночи любого поклонника онлайн игр и попросите его назвать самую популярную ММОРПГ – он без раздумий назовет вам World of Warcraft. Эта MMORPG, несмотря на довольно внушительный возраст (многие, очень многие онлайн проекты о такой продолжительности жизни даже не мечтают), все еще находится в списке самых популярных игр и вряд ли в обозримом будущем покинет его – на подходе новое крупное дополнение и запуск «классических» серверов, так что приток аудитории WoW обеспечен.",
      "link": "https://worldofwarcraft.com/ru-ru/",
      "img": "/img/wow.jpg",
      "routingUrl": "worldofwarcraft"
    },
    {
      "id": 6,
      "title": "OVERWATCH",
      "description": "Сетевой шутер от Blizzard, пользующийся впечатляющим успехом у ценителей жанра. Разработчики уместили в одной игре интересный сюжет, динамичный геймплей, харизматичных героев, приправили все это постоянным поступлением контента и AR-элементами – анонсам новых персонажей предшествуют многочисленные намеки и загадки, за разгадку которых геймеры берутся с огромным энтузиазмом.",
      "link": "https://playoverwatch.com/ru-ru/",
      "img": "/img/overwatch.jpeg",
      "routingUrl": "overwatch"
    },
    {
      "id": 7,
      "title": "COUNTER-STRIKE: GLOBAL OFFENSIVE",
      "description": "Одна из самых популярных онлайн игр в мире, соревновательный шутер, завоевавший множество наград, знаменитый симулятор противостояния спецназа и террористов – все это о Counter-Strike: Global Offensive. Детище Valve постоянно привлекает новых игроков, которые сражаются в мультиплеерных матчах, зарабатывают состояния на продаже уникальных скинов, следят за успехами любимых команд на международных киберспортивных турнирах. Многие сетевые шутеры загораются и быстро гаснут на небосклоне игровой индустрии, но Counter-Strike все так же сияет и даже не думает покидать свое место.",
      "link": "https://store.steampowered.com/app/730/CounterStrike_Global_Offensive/",
      "img": "/img/csgo.jpeg",
      "routingUrl": "counterstrikeglobaloffensive"
    },
    {
      "id": 8,
      "title": "WORLD OF TANKS",
      "description": "Всемирно известный ММО-экшен от Wargaming собрал уже несколько десятков миллионов «танкистов», ежедневно участвующих в сетевых баталиях. World of Tanks берет интересным сеттингом, большим количеством военной техники, выполненной с вниманием к деталям и соответствием ТТХ своих реальных прототипов, затягивающим геймплеем и мощным сообществом, сформировавшимся вокруг игры. Найти соперников для мультиплеерных сражений в WoT можно днем и ночью, за что проект и заслуживает места в нашей подборке самых популярных онлайн игр на ПК.",
      "link": "https://worldoftanks.com/",
      "img": "/img/wot.jpg",
      "routingUrl": "worldoftanks"
    },
    {
      "id": 9,
      "title": "WAR THUNDER",
      "description": "Еще один проект, посвященный военной технике, но, в отличие от World of Tanks, собравший на поле боя не только танки, но также самолеты, вертолеты и корабли. Это, в совокупности с красивой графикой, разнообразием режимов и регулярным поступлением нового контента, привлекло в игру огромную аудиторию.",
      "link": "https://warthunder.ru/ru/",
      "img": "/img/wartunder.jpeg",
      "routingUrl": "warthunder"
    },
    {
      "id": 10,
      "title": "HEARTHSTONE",
      "description": "Бесплатная ККИ от Blizzard, получившая признание геймеров благодаря нескольким факторам: во-первых, узнаваемым персонажам вселенной Warcraft, во-вторых, тщательно выверенному геймплею, в-третьих, идеальному балансу (правда, последний со временем все же стал немного хромать). Hearthstone не отнимает много времени, доступна не только на компьютере, но также на мобильных устройствах, что позволяет играть, например, в метро или автобусе. Все это поспособствовало большой популярности игры.",
      "link": "https://playhearthstone.com/ru-ru/",
      "img": "/img/hs.jpg",
      "routingUrl": "hearthstone"
    },
    {
      "id": 11,
      "title": "TEAM FORTRESS 2",
      "description": "Несмотря на свой почтенный возраст, Team Fortress 2 все еще собирает достаточно большую аудиторию из тех, кому нравятся динамичные и в то же время легкомысленные, наполненные юмором, шутеры. Valve не разочаровывает поклонников: игра получает все больше карт, режимов, предметов снаряжения, а самое главное – шляп.",
      "link": "https://store.steampowered.com/app/440/Team_Fortress_2/",
      "img": "/img/tf2.jpeg",
      "routingUrl": "teamfortess2"
    },
    {
      "id": 12,
      "title": "WARFRAME",
      "description": "Warframe ценится игроками за кооператив, качественный геймплей, а также интересный, хоть и необычный, мир. Авторы проекта часто радуют пользователей новыми персонажами, локациями, снаряжением и режимами, активно работают над улучшением игрового процесса и графики. Одним из главных преимуществ Warframe перед другими ААА-шутерами является бесплатность игры – в сочетании с вышеперечисленными достоинствами это обеспечивает детищу канадцев из Digital Extremes стабильно высокий онлайн.",
      "link": "https://www.warframe.com/landing",
      "img": "/img/warframe.jpg",
      "routingUrl": "warframe"
    },
    {
      "id": 13,
      "title": "GTA ONLINE",
      "description": "Rockstar развивает Grand Theft Auto V как игру-сервис, постоянно выпуская бесплатные дополнения для мультиплеера. Поэтому играть в GTA Online всегда интересно – здесь регулярно появляются новые миссии, автомобили, костюмы и режимы. Недавно издатель отчитался о 85 млн проданных копий GTA V на всех платформах, и, без сомнений, большая часть покупателей после прохождения сюжетной кампании отправилась в сетевой режим. Так что Лос-Сантос в GTA Online никогда не пустует.",
      "link": "https://www.rockstargames.com/V/",
      "img": "/img/gta.jpeg",
      "routingUrl": "gtaonline"
    },
    {
      "id": 14,
      "title": "PAYDAY 2",
      "description": "Кооперативный шутер, целиком завязанный на ограблениях: игроки должны спланировать, подготовить, а затем выполнить преступление, используя различные гаджеты и оружие. Хорошую реиграбельность проекту обеспечила частичная генерация локаций: расположение дверей, камер, комнат, а также расстановка ботов осуществляется случайным образом в каждой новой миссии, так что следующее ограбление будет совершенно не похожим на предыдущее.",
      "link": "https://store.steampowered.com/agecheck/app/218620/",
      "img": "/img/pd2.jpg",
      "routingUrl": "payday2"
    },
    {
      "id": 15,
      "title": "ARK: SURVIVAL EVOLVED",
      "description": "Одна из самых успешных песочниц все еще страдает от проблем, связанных с оптимизацией и наличием багов. Тем не менее игроки любят ARK: Survival Evolved за обилие интересного контента и возможность отправиться в полный тайн мир, где одновременно уживаются доисторические динозавры и футуристические технологии. Поэтому в игре всегда можно найти напарников для совместного выживания – или же соперников для конкуренции за территории и ресурсы.",
      "link": "https://store.steampowered.com/app/346110/ARK_Survival_Evolved/",
      "img": "/img/ark.jpg",
      "routingUrl": "arksurvivalevolved"
    }
  ],
  "commentsToGamesList": [
    {
      "id": 1,
      "game": "fortnite",
      "autorLogin": "denis",
      "autorId": 4,
      "comment": "Интересная игра, понравилась."
    },
    {
      "id": 3,
      "game": "dota2",
      "autorLogin": "ivan12345",
      "autorId": 2,
      "comment": "Что-то сложновато играть."
    },
    {
      "id": 2,
      "comment": "Крутая игра, но не очень реалистична.",
      "game": "fortnite",
      "autorLogin": "petya12345",
      "autorId": 3
    },
    {
      "id": 4,
      "game": "fortnite",
      "autorLogin": "ivan12345",
      "autorId": 2,
      "comment": "Что-то сложновато играть."
    },
    {
      "id": 5,
      "game": "fortnite",
      "autorLogin": "admin",
      "autorId": 1,
      "comment": "Что-то сложновато играть."
    }
  ],
  "weather": [
    {
      "id": 1,
      "cityName": "Москва",
      "weatherDescription": "ясно",
      "pressure": 1023,
      "humidity": 32,
      "temp": 13,
      "wind": 3
    },
    {
      "id": 2,
      "cityName": "Санкт-Петербург",
      "weatherDescription": "пасмурно",
      "pressure": 1027,
      "humidity": 42,
      "temp": 7,
      "wind": 4
    },
    {
      "id": 3,
      "cityName": "Пенза",
      "weatherDescription": "слегка пасмурно",
      "pressure": 1027,
      "humidity": 31,
      "temp": 11,
      "wind": 1.9
    },
    {
      "id": 4,
      "cityName": "Тюмень",
      "weatherDescription": "пасмурно",
      "pressure": 1018,
      "humidity": 45,
      "temp": 7,
      "wind": 4
    },
    {
      "id": 5,
      "cityName": "Красноярск",
      "weatherDescription": "ясно",
      "pressure": 1008,
      "humidity": 28,
      "temp": 6,
      "wind": 1
    },
    {
      "id": 5,
      "cityName": "Владивосток",
      "weatherDescription": "пасмурно",
      "pressure": 1009,
      "humidity": 75,
      "temp": 6,
      "wind": 1
    }
  ]
}
